Autodesk.Revit.DB.IFC.IFCData.AsAggregate
Gets storage value as IFCAggregate when its PrimitiveType is aggregate.
Returns:
The IFCAggregate.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not aggregate.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsInstance
Gets storage value as IFCAnyHandle when its PrimitiveType is instance.
Returns:
The IFCAnyHandle.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not instance.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsString
Gets storage value as string when its PrimitiveType is string, binary or enumeration.
Returns:
The string value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not string, binary or enumeration.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsLogical
Gets storage value as IFCLogical when its PrimitiveType is logical.
Returns:
The IFCLogical value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not logical.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsBoolean
Gets storage value as boolean when its PrimitiveType is boolean.
Returns:
The bool value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not boolean.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsDouble
Gets storage value as double when its PrimitiveType is double.
Returns:
The double value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not double.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.AsInteger
Gets storage value as integer when its PrimitiveType is integer.
Returns:
The int value.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The primitive type is not integer.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.GetTypeList
Gets the multiple strings represent one IFC type name.
Returns:
The strings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No type assigned or it is a simple type.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.SetTypeList(System.Collections.Generic.IList`1{System.String})
Sets the corresponding IFC type by its type list name.
Remarks:
This sets the IFC type represented by a string list.
For example, DIMENSION(DIAMETER(INCH(5.0))). It's primitive type is double and the value is 5.0. Its IFC type is DIMENSION/DIAMETER/INCH.
The string list represents the type is "DIMENSION"-"DIAMETER"-"INCH".
typeList:
The strings represent the name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.GetSimpleType
Gets the IFC type name.
Returns:
The name.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No type assigned or it is not a simple type.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.HasSimpleType
Determines if there is one corresponding IFC type.
Returns:
False if there are no corresponding IFC types, or more than one; returns true otherwise.
Since:
2015

Autodesk.Revit.DB.IFC.IFCData.SetSimpleType(System.String)
Sets the corresponding IFC type by its name.
typeName:
The name of the type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateStringOfType(System.String,System.String)
Creates a string data object of the specified type.
value:
The string value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateLogicalOfType(Autodesk.Revit.DB.IFC.IFCLogical,System.String)
Creates a logical data object of the specified type.
value:
The IFCLogical value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.IFC.IFCData.CreateBooleanOfType(System.Boolean,System.String)
Creates a boolean data object of the specified type.
value:
The boolean value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateDoubleOfType(System.Double,System.String)
Creates a double data object of the specified type.
value:
The double value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIntegerOfType(System.Int32,System.String)
Creates an integer data object of the specified type.
value:
The integer value.
typeName:
The type name.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIFCAggregate(Autodesk.Revit.DB.IFC.IFCAggregate)
Creates an IFCAggregate data object.
value:
The IFCAggregate value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateIFCAnyHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Creates an IFCAnyHandle data object.
value:
The IFCAnyHandle value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateEnumeration(System.String)
Creates a enum data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateBinary(System.String)
Creates a binary data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateString(System.String)
Creates a string data object.
value:
The string value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateLogical(Autodesk.Revit.DB.IFC.IFCLogical)
Creates a logical data object.
value:
The IFCLogical value.
Returns:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateBoolean(System.Boolean)
Creates a boolean data object.
value:
The boolean value.
Returns:
The IFCData object.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateDouble(System.Double)
Creates a double data object.
value:
The double value.
Returns:
The IFCData object.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.CreateInteger(System.Int32)
Creates an integer data object.
value:
The integer value.
Returns:
The IFCData object.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCData.PrimitiveType
The primitive data type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.HasValue
Identifies if the data is empty or contains a value.
Since:
2013

Autodesk.Revit.DB.IFC.IFCData.GetHashCode
Gets the hash code.

Autodesk.Revit.DB.IFC.IFCData.Equals(System.Object)
Determines whether the specified System.Object is equal to the current System.Object.
obj:  Another object.

Autodesk.Revit.DB.IFC.IFCData.op_Inequality(Autodesk.Revit.DB.IFC.IFCData,Autodesk.Revit.DB.IFC.IFCData)
Determines whether two IFCDatas are different.
first: The first IFCData.
second: The second IFCData.
Returns: True if the IFCDatas are different; otherwise, false.

Autodesk.Revit.DB.IFC.IFCData.op_Equality(Autodesk.Revit.DB.IFC.IFCData,Autodesk.Revit.DB.IFC.IFCData)
Determines whether two IFCDatas are the same.
first: The first IFCData.
second: The second IFCData.
Returns: True if the IFCDatas are the same; otherwise, false.

Autodesk.Revit.DB.IFC.IFCData.#ctor(Autodesk.Revit.DB.IFC.IFCData)
Creates a copy object.
from:
The IFCData object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCData
A specialized type of abstract data block that can represent any data type.
Since:
2013